src/Tasks/ЗадачаПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Task>
		<Properties>
			<Name>ЗадачаПользователей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Comment>Дата и время фактического выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаТема</Name>
					<Comment>Содержание задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаПредмет</Name>
					<Comment>Предмет задачи</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаАвтор</Name>
					<Comment>Автор бизнес-процесса, который сформировал задачу</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаОписание</Name>
					<Comment>Подробное описание задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаНазначеннаяДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеИспользовать</Name>
					<Comment>Напоминать о задаче</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеРежим</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНапоминаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеЗадачи</Name>
					<Comment>Представление задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Исполнитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

src/Catalogs/ГруппыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ГруппыПользователей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Tasks/ЗадачаПользователей/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик создания формы на серевер
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Если НЕ МобильноеПриложениеСервер Тогда
	Если НЕ ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.ОтображатьЗадачиВсехПользователей, Ложь)  Тогда

		ПоИсполнителю                      = ПараметрыСеанса.ТекущийПользователь;
		Элементы.ПоИсполнителю.Видимость   = Ложь;
		Элементы.ГрПоИсполнителю.Видимость = Ложь;
		
	КонецЕсли;
	#КонецЕсли
	
	Если Параметры.Свойство("Предмет") Тогда
		Клиент = Параметры.Предмет;	
	КонецЕсли;	
	
	УстановитьОтбор();

КонецПроцедуры

&НаСервере
// Обработчик загрузки настроек формы
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	#Если НЕ МобильноеПриложениеСервер Тогда
	Если НЕ ПользователиСтоматология.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.ОтображатьЗадачиВсехПользователей, Ложь)  Тогда

		ПоИсполнителю = ПараметрыСеанса.ТекущийПользователь;
				
	КонецЕсли;
	
	УстановитьОтбор();
	#КонецЕсли
		
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// при активации строки в таблице задачи
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И  ТекущиеДанные.Свойство("Выполнена") Тогда 
		
		Элементы.ПринятьКИсполнению.Доступность  = Ложь;
		Элементы.ОтменитьНапоминание.Доступность = Ложь;
		Элементы.СписокКонтекстноеМенюОтменитьПринятиеКИсполнению.Доступность  = Ложь;
		Элементы.СписокКонтекстноеМенюПринятьКИсполнению.Доступность           = Ложь;
	
		Если НЕ ТекущиеДанные.Выполнена Тогда
			
			Если ТекущиеДанные.НеНапоминать Тогда
				
				Элементы.ПринятьКИсполнению.Доступность                                = Истина;
				Элементы.СписокКонтекстноеМенюПринятьКИсполнению.Доступность           = Истина;
				Элементы.ОтменитьНапоминание.Доступность                               = Ложь;
				Элементы.СписокКонтекстноеМенюОтменитьПринятиеКИсполнению.Доступность  = Ложь;

			Иначе
				
				Элементы.ПринятьКИсполнению.Доступность                                = Ложь;
				Элементы.СписокКонтекстноеМенюПринятьКИсполнению.Доступность           = Ложь;
				Элементы.ОтменитьНапоминание.Доступность                               = Истина;
				Элементы.СписокКонтекстноеМенюОтменитьПринятиеКИсполнению.Доступность  = Истина;

            КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик переопределения действий по выбору исполнителя
Процедура ПоИсполнителюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПоИсполнителюНачалоВыбораЗавершение", ЭтотОбъект);
	ОткрытьФорму("Задача.ЗадачаПользователей.Форма.ФормаВыбораИсполнителя",
	Новый Структура("Ключ",ПоИсполнителю),,,,,
	Оповещение, 
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	
КонецПроцедуры

&НаКлиенте
// Процедура - После открытия формы выбора исполнителя
//
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
//
Процедура ПоИсполнителюНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ПоИсполнителю  = ?(Результат <> Неопределено,Результат,ПоИсполнителю);
	КонецЕсли;         
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
// Обработчик установки отбора по исполнителю
Процедура ПоИсполнителюПриИзменении(Элемент)
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
// Обработчик установки отбора по автору
Процедура ПоАвторуПриИзменении(Элемент)
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
// При изменении состояния флагов отображения задач
Процедура ПоказыватьЗадачиПриИзменении(Элемент)
	
	УстановитьОтбор();
	
КонецПроцедуры

&НаКлиенте
// Обработчик изменения статуса задачи
Процедура ПринятьКИсполнению(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 

       Если ПринятьКисполнениюОтменитьСервер(ТекущиеДанные,Истина) Тогда
	       Элементы.Список.Обновить();
	   Иначе
		   ПоказатьПредупреждение(,"Задача уже выполнена!");
	   КонецЕсли;
	   
     КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик изменения статуса задачи
Процедура ОтменитьПринятиеКИсполнению(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 

       Если ПринятьКисполнениюОтменитьСервер(ТекущиеДанные,Ложь) Тогда
	        Элементы.Список.Обновить();
	   Иначе
			ПоказатьПредупреждение(,"Задача уже выполнена!");
	   КонецЕсли;
		
     КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПрименениеГруппировокВТаблице

&НаКлиенте
// Обработчик снятия группировки
Процедура ГруппировкаОтменить(Команда)
	
	ВостановитьВидимостьКолонок();
	ОбщегоНазначенияКлиентСтоматология.СнятьГруппировкуСписка(Список);
	
КонецПроцедуры

&НаКлиенте
// Обработчик установки группировки по предмету
Процедура ГруппировкаПопредмету(Команда)
	
	ОбщегоНазначенияКлиентСтоматология.СнятьГруппировкуСписка(Список);
    ОбщегоНазначенияКлиентСтоматология.УстановитьГруппировкуСписка(Список,"ЗадачаПредмет");	 
	
	ВостановитьВидимостьКолонок();
		   
КонецПроцедуры

&НаКлиенте
// Обработчик установки группировки по дням
Процедура ГруппировкаПоДням(Команда)
	
	ВостановитьВидимостьКолонок();
	ОбщегоНазначенияКлиентСтоматология.СнятьГруппировкуСписка(Список);
	ОбщегоНазначенияКлиентСтоматология.УстановитьГруппировкуСписка(Список,"Дата",ТипДополненияПериодаКомпоновкиДанных.День);	   

КонецПроцедуры

&НаКлиенте
// Обработчик установки группировки по месяцам
Процедура ГруппировкаПоМесяцам(Команда)
	
	ВостановитьВидимостьКолонок();
	ОбщегоНазначенияКлиентСтоматология.СнятьГруппировкуСписка(Список);
	ОбщегоНазначенияКлиентСтоматология.УстановитьГруппировкуСписка(Список,"Дата",ТипДополненияПериодаКомпоновкиДанных.Месяц);
	
КонецПроцедуры

&НаКлиенте
// Обработчик установки группировки по теме
Процедура ГруппировкаПоТеме(Команда)
	
	ОбщегоНазначенияКлиентСтоматология.СнятьГруппировкуСписка(Список);
    ОбщегоНазначенияКлиентСтоматология.УстановитьГруппировкуСписка(Список,"ЗадачаТема");
	
	ВостановитьВидимостьКолонок();
	Элементы.СписокНаименование.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
// Обработчик установки группировки по Исполнителю
Процедура ГруппировкаПоИсполнителю(Команда)
	
	ОбщегоНазначенияКлиентСтоматология.СнятьГруппировкуСписка(Список);
    ОбщегоНазначенияКлиентСтоматология.УстановитьГруппировкуСписка(Список,"Исполнитель");
	
	ВостановитьВидимостьКолонок();
	Элементы.СписокИсполнитель.Видимость = Ложь;

КонецПроцедуры

&НаКлиенте
// Обработчик установки группировки по Автору
Процедура ГруппировкаПоАвтору(Команда)
	
	ОбщегоНазначенияКлиентСтоматология.СнятьГруппировкуСписка(Список);
    ОбщегоНазначенияКлиентСтоматология.УстановитьГруппировкуСписка(Список,"ЗадачаАвтор");

	ВостановитьВидимостьКолонок();
	Элементы.СписокАвтор.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
// Восстановить видимость колонок списка
Процедура ВостановитьВидимостьКолонок()
	
	Элементы.СписокПредмет.Видимость      = Истина;
    Элементы.СписокНаименование.Видимость = Истина;
	Элементы.СписокИсполнитель.Видимость  = Истина;
    Элементы.СписокАвтор.Видимость        = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
// Установить отбор для задач
Процедура УстановитьОтбор()
		
	ПараметрыОтбора = Новый Соответствие();
	ПараметрыОтбора.Вставить("ПоАвтору"		   , ПоАвтору);
	ПараметрыОтбора.Вставить("ЗадачаПредмет"   , Клиент);
	ПараметрыОтбора.Вставить("ПоИсполнителю"   , ПоИсполнителю);
	ПараметрыОтбора.Вставить("ПоказыватьЗадачи", ПоказыватьЗадачи);
	УстановитьОтборСписка(Список, ПараметрыОтбора);
	
КонецПроцедуры	

&НаСервереБезКонтекста
// Установить список отбора
Процедура УстановитьОтборСписка(Список, ПараметрыОтбора)
	
	Если ПараметрыОтбора["ПоАвтору"].Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "ЗадачаАвтор");
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор, "ЗадачаАвтор", ПараметрыОтбора["ПоАвтору"],,,Истина);
	КонецЕсли;
	
	Если ПараметрыОтбора["ЗадачаПредмет"].Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "ЗадачаПредмет");
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор, "ЗадачаПредмет", ПараметрыОтбора["ЗадачаПредмет"],,,Истина);
	КонецЕсли;
	
	Если  ПараметрыОтбора["ПоИсполнителю"] = Неопределено ИЛИ ПараметрыОтбора["ПоИсполнителю"].Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "Исполнитель");
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор, "Исполнитель", ВернутьМассивПользователейИГрупп(ПараметрыОтбора["ПоИсполнителю"]), ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "Выполнена");
	
	Если ПараметрыОтбора["ПоказыватьЗадачи"] <> 0 Тогда 
		
		Если ПараметрыОтбора["ПоказыватьЗадачи"] = 1 Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
				Список.Отбор, "Выполнена", Истина,,,Истина);
		КонецЕсли;
		
		Если ПараметрыОтбора["ПоказыватьЗадачи"] = 2 Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
				Список.Отбор, "Выполнена", Ложь,,,Истина);
		КонецЕсли;	
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьМассивПользователейИГрупп(ЭлементСсылка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&ЭлементСсылка КАК Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГруппыПользователей.Ссылка
	|ИЗ
	|	Справочник.ГруппыПользователей КАК ГруппыПользователей
	|ГДЕ
	|	ГруппыПользователей.Состав.Пользователь = &ЭлементСсылка
	|	И ГруппыПользователей.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГруппыПользователейСостав.Пользователь
	|ИЗ
	|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|ГДЕ
	|	ГруппыПользователейСостав.Ссылка = &ЭлементСсылка
	|	И ГруппыПользователейСостав.Ссылка.ПометкаУдаления = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("ЭлементСсылка", ЭлементСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервере
// Изменить статус задачи
Функция ПринятьКисполнениюОтменитьСервер(Задача,ПринятьКИсполнению)
	
	Если НЕ Задача.Выполнена Тогда
		
		ОбъектЗадачи = Задача.Ссылка.ПолучитьОбъект();
		ОбъектЗадачи.НапоминаниеИспользовать = ПринятьКИсполнению;
		ОбъектЗадачи.Записать();
		Возврат Истина;
		
	Иначе
		Возврат Ложь;
    КонецЕсли;

КонецФункции

#КонецОбласти
